# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalEquipmentLoadData..::..Current Property
AnalyticalEquipmentLoadData Class See Also
---
The current of the analytical equipment load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double Current { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Current As Double
	Get
```

Visual C++
---
```text
public:
property double Current {
	double get ();
}
```

# See Also
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace